In [1]:
import numpy as np
import pandas as pd

In [2]:
data ={
    'Student_ID': range(1,11),
    'Marks': [85,78,np.nan,92,88,69,95,np.nan,80,89],
    'Attendance':[95,88,90,np.nan,85,80,92,78,np.nan,87],
    'Study_hours':[5,4,6,7,5,np.nan,8,4,6,5],
    'Extracuriicular':['Yes','No','Yes',np.nan,'No','Yes','No','Yes',np.nan,'No']
}

In [3]:
df =pd.DataFrame(data)

In [4]:
df.head()

   Student_ID  Marks  Attendance  Study_hours Extracuriicular
0           1   85.0        95.0          5.0             Yes
1           2   78.0        88.0          4.0              No
2           3    NaN        90.0          6.0             Yes
3           4   92.0         NaN          7.0             NaN
4           5   88.0        85.0          5.0              No

In [5]:
df.tail()

   Student_ID  Marks  Attendance  Study_hours Extracuriicular
5           6   69.0        80.0          NaN             Yes
6           7   95.0        92.0          8.0              No
7           8    NaN        78.0          4.0             Yes
8           9   80.0         NaN          6.0             NaN
9          10   89.0        87.0          5.0              No

In [6]:
df.isna()

   Student_ID  Marks  Attendance  Study_hours  Extracuriicular
0       False  False       False        False            False
1       False  False       False        False            False
2       False   True       False        False            False
3       False  False        True        False             True
4       False  False       False        False            False
5       False  False       False         True            False
6       False  False       False        False            False
7       False   True       False        False            False
8       False  False        True        False             True
9       False  False       False        False            False

In [7]:
df['Marks']=df['Marks'].fillna(df['Marks'].mean())
df['Attendance']=df['Attendance'].fillna(df['Attendance'].mode())
df['Study_hours']=df['Study_hours'].fillna(df['Study_hours'].median())

In [8]:
Q1 = df['Marks'].quantile(0.25)
Q3 = df['Marks'].quantile(0.75)
IQR = Q3-Q1
lower_bound=Q1-1.5*IQR
upper_bound=Q3+1.5*IQR
lower_bound, upper_bound

(69.6875, 100.1875)

In [9]:
r_outlier=[]
for i in df['Marks']:
    if i <lower_bound or i > upper_bound:
        r_outlier.append(i)
        print(r_outlier)

[69.0]